In [2]:
import pandas as pd

In [3]:
from numpy.random import rand

In [9]:
df=pd.DataFrame([['april',27,2929.20],['march',20,1994,15]], columns=['month','day','year','hour'])
df

   month  day    year  hour
0  april   27  2929.2   NaN
1  march   20  1994.0  15.0

In [13]:
df=pd.DataFrame(rand(5,4),index='A B C D E '.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.280907  0.706435  0.724671  0.819216
B  0.143594  0.688291  0.715054  0.656093
C  0.984644  0.149899  0.846587  0.464338
D  0.390652  0.019877  0.239807  0.907567
E  0.038498  0.273806  0.967524  0.306703

In [14]:
df[['W','Y']]

          W         Y
A  0.280907  0.724671
B  0.143594  0.715054
C  0.984644  0.846587
D  0.390652  0.239807
E  0.038498  0.967524

In [15]:
df['Z']

A    0.819216
B    0.656093
C    0.464338
D    0.907567
E    0.306703
Name: Z, dtype: float64

In [18]:
df['new']=df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.280907  0.706435  0.724671  0.819216  1.005578
B  0.143594  0.688291  0.715054  0.656093  0.858648
C  0.984644  0.149899  0.846587  0.464338  1.831232
D  0.390652  0.019877  0.239807  0.907567  0.630459
E  0.038498  0.273806  0.967524  0.306703  1.006023

In [19]:
df

          W         X         Y         Z       new
A  0.280907  0.706435  0.724671  0.819216  1.005578
B  0.143594  0.688291  0.715054  0.656093  0.858648
C  0.984644  0.149899  0.846587  0.464338  1.831232
D  0.390652  0.019877  0.239807  0.907567  0.630459
E  0.038498  0.273806  0.967524  0.306703  1.006023

In [22]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.280907  0.706435  0.724671  0.819216
B  0.143594  0.688291  0.715054  0.656093
C  0.984644  0.149899  0.846587  0.464338
D  0.390652  0.019877  0.239807  0.907567
E  0.038498  0.273806  0.967524  0.306703

In [23]:
df

          W         X         Y         Z       new
A  0.280907  0.706435  0.724671  0.819216  1.005578
B  0.143594  0.688291  0.715054  0.656093  0.858648
C  0.984644  0.149899  0.846587  0.464338  1.831232
D  0.390652  0.019877  0.239807  0.907567  0.630459
E  0.038498  0.273806  0.967524  0.306703  1.006023

In [24]:
df.drop('new',axis=1,inplace=True)

In [25]:
df

          W         X         Y         Z
A  0.280907  0.706435  0.724671  0.819216
B  0.143594  0.688291  0.715054  0.656093
C  0.984644  0.149899  0.846587  0.464338
D  0.390652  0.019877  0.239807  0.907567
E  0.038498  0.273806  0.967524  0.306703

In [26]:
df=pd.DataFrame([[4,2,1994,12],[6,13,1212,16]],columns=['month','day','year','hour'])
df

   month  day  year  hour
0      4    2  1994    12
1      6   13  1212    16

In [29]:
df=pd.DataFrame(rand(4,8),index='a b c d'.split(),columns='z y t r u k g p'.split())
df

,z,y,t,r,u,k,g,p
a,0.870614,0.142055,0.869025,0.582124,0.672943,0.789636,0.107310,0.245184
b,0.467755,0.308701,0.071893,0.799399,0.012157,0.422921,0.140400,0.624843
c,0.198052,0.095390,0.584612,0.699259,0.762404,0.015653,0.327003,0.119103
d,0.952261,0.581202,0.742943,0.904483,0.801761,0.407386,0.060644,0.436363

In [31]:
df.loc['a']

z    0.870614
y    0.142055
t    0.869025
r    0.582124
u    0.672943
k    0.789636
g    0.107310
p    0.245184
Name: a, dtype: float64

In [35]:
df.iloc[2]

z    0.198052
y    0.095390
t    0.584612
r    0.699259
u    0.762404
k    0.015653
g    0.327003
p    0.119103
Name: c, dtype: float64

In [39]:
df.reset_index()

,index,z,y,t,r,u,k,g,p
0,a,0.870614,0.142055,0.869025,0.582124,0.672943,0.789636,0.107310,0.245184
1,b,0.467755,0.308701,0.071893,0.799399,0.012157,0.422921,0.140400,0.624843
2,c,0.198052,0.095390,0.584612,0.699259,0.762404,0.015653,0.327003,0.119103
3,d,0.952261,0.581202,0.742943,0.904483,0.801761,0.407386,0.060644,0.436363

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   z       4 non-null      float64
 1   y       4 non-null      float64
 2   t       4 non-null      float64
 3   r       4 non-null      float64
 4   u       4 non-null      float64
 5   k       4 non-null      float64
 6   g       4 non-null      float64
 7   p       4 non-null      float64
dtypes: float64(8)
memory usage: 448.0+ bytes

In [42]:
df.describe()

,z,y,t,r,u,k,g,p
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000
mean,0.622170,0.281837,0.567118,0.746316,0.562316,0.408899,0.158839,0.356373
std,0.353273,0.219577,0.350055,0.137850,0.370712,0.316124,0.116786,0.221461
min,0.198052,0.095390,0.071893,0.582124,0.012157,0.015653,0.060644,0.119103
25%,0.400329,0.130389,0.456432,0.669975,0.507747,0.309453,0.095643,0.213664
50%,0.669184,0.225378,0.663777,0.749329,0.717674,0.415153,0.123855,0.340774
75%,0.891026,0.376826,0.774463,0.825670,0.772243,0.514600,0.187051,0.483483
max,0.952261,0.581202,0.869025,0.904483,0.801761,0.789636,0.327003,0.624843

In [43]:
fox=[1,2,3,4]
rat=[num+1 for num in fox]
print(rat)

[2, 3, 4, 5]

In [44]:
fox=[1,2,3,4]
rat=[]
for num in fox:
    rat.append(num+1)
print(rat)

[2, 3, 4, 5]

In [46]:
hen=[num for num in range(10)]
print(hen)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [48]:
rab=[]
rab=hen.append(num+1)
print(rab)

None